Revit 2026 API

# TextRange Constructor

---

Constructs a TextRange with default values for start and length.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public TextRange()
```
```vb
Public Sub New
```
```cpp
public:
TextRange()
```
```fsharp
new : unit -> TextRange
```

The start and length are set to be 0 by default.

#### Reference

TextRange Class

TextRange Overload

Autodesk.Revit.DB Namespace